clearing some warnings and ascii diagram
